# pandas
pandas is a fast, powerful, flexible and easy to use open source **data analysis and manipulation tool**, built on top of the Python programming language.

pandas makes working with “relational” or “labeled” data both easy and intuitive.

pandas blends the high-performance, array-computing ideas of NumPy with the flexible data manipulation capabilities of spreadsheets and relational databases (such as
SQL). 

### What Is Data Science?
There’s a joke that says a data scientist is someone who knows more
statistics than a computer scientist and more computer science than a
statistician

### NumPy
NumPy, short for Numerical Python, has long been a cornerstone of numerical computing in Python. 
It provides the data structures, algorithms, and library glue needed for most scientific applications involving numerical data in Python. 
NumPy contains, among other things:
- A fast and efficient multidimensional array object `ndarray` (The "nd" in ndarray stands for "n-dimensional")
- Functions for performing element-wise computations with arrays or mathematical operations between arrays
- Tools for reading and writing array-based datasets to disk
- Linear algebra operations, Fourier transform, and random number generation
- A mature C API to enable Python extensions and native C or C++ code to access NumPy’s data structures and computational facilities

One of the reasons NumPy is so important for numerical computations in Python is because it is designed for **efficiency on large arrays of data**. There are a number of reasons for this:
- NumPy internally stores data in a contiguous block of memory, independent of other built-in Python objects. NumPy’s library of algorithms written in the C lan‐
guage can operate on this memory without any type checking or other overhead. NumPy arrays also use much less memory than built-in Python sequences.
- NumPy operations perform complex computations on entire arrays without the need for Python for loops.


## Install
pandas can be installed via pip from PyPI.

`pip install pandas`

### Import Conventions
The Python community has adopted a number of naming conventions for commonly used modules:

In [78]:
import pandas as pd

### DataFrame
When working with tabular data, such as data stored in spreadsheets or databases, pandas is the right tool for you. pandas will help you to explore, clean, and process your data. 

In pandas, a data table is called a **DataFrame**.

We can simply think of a DataFrame by a list of rows, where is row is a list:
```
[
    [90, 'Turkey', 'Ankara'], 
    [44, 'United Kingdom', 'London'], 
    [1, 'United States', 'Washington'], 
    [81, 'Japan', 'Tokyo'], 
    [86, 'China', 'Beijing']
]
````

Another model is a dictionary, where keys are the "column names" and values are the lists:
```
(singular)  person = {
                    "name"      : "value",
                    "lastname"  : "value"
            }

(plural)    people = {
                    "name"      : ["value1", "value2"],
                    "lastname"  : ["value1", "value2"]
            }
```

In [79]:
# Manually build DataFrame
# Option 1 -
# data, as a list of lists - each item in the list is a list representing a ROW
country_codes = pd.DataFrame(
    [[90, 'Turkey', 'Ankara'], [44, 'United Kingdom', 'London'], [1, 'United States', 'Washington'], [81, 'Japan', 'Tokyo'], [86, 'China', 'Beijing']],
    index=['TR', 'UK', 'US', 'JP', 'CN'],
    columns=['code', 'name', 'capital']
)
'''
    code            name     capital
TR    90          Turkey      Ankara
UK    44  United Kingdom      London
US     1   United States  Washington
JP    81           Japan       Tokyo
CN    86           China     Beijing
'''
print(country_codes)

    code            name     capital
TR    90          Turkey      Ankara
UK    44  United Kingdom      London
US     1   United States  Washington
JP    81           Japan       Tokyo
CN    86           China     Beijing

### Option 2 - Create a DataFrame from a Python dict

from python dictionary:
```
{
    'LastName':['Booker', 'Grey', 'Johnson', 'Jenkins', 'Smith'],
    'Email': ['bo@example.com', 'gr@example.com', 'jo@example.com', 'je@example.com', 'sm@example.com'],
    'Username': ['booker12', 'grey07', 'johnson81', 'jenkins46', 'smith79']
}
```

to pandas DataFrame:
```
  LastName           Email   Username
0   Booker  bo@example.com   booker12
1     Grey  gr@example.com     grey07
2  Johnson  jo@example.com  johnson81
3  Jenkins  je@example.com  jenkins46
4    Smith  sm@example.com    smith79
```

In [80]:
# Option 2 - Create a DataFrame from a Python dict
# A seperate list representing each COLUMN
# person = {
#     "name"      : "value",
#     "lastname"  : "value"
#     }
# people = {
#     "name"      : ["value1","value2"],
#     "lastname"  : ["value1","value2"]
#     }
lastnames = ['Booker', 'Grey', 'Johnson', 'Jenkins', 'Smith']
emails = ['bo@example.com', 'gr@example.com', 'jo@example.com', 'je@example.com', 'sm@example.com']
usernames = ['booker12', 'grey07', 'johnson81', 'jenkins46', 'smith79']

# A dictionary where keys are the "column names" and values are the lists:
users_dict = {'LastName': lastnames, 'Email': emails, 'Username': usernames}

# Create a DataFrame from a Python dict:
# df = pd.DataFrame({'col1':[], 'col2':[]})
df_users = pd.DataFrame(users_dict)

print(df_users)

  LastName           Email   Username
0   Booker  bo@example.com   booker12
1     Grey  gr@example.com     grey07
2  Johnson  jo@example.com  johnson81
3  Jenkins  je@example.com  jenkins46
4    Smith  sm@example.com    smith79

## Which file formats?
pandas supports the integration with many file formats or data sources out of the box (csv, excel, sql, json, parquet,…). Importing data from each of these data sources is provided by function with the prefix `read_*`. Similarly, the `to_*` methods are used to store data.

In [81]:
df = pd.read_csv("data/users.csv")
print(df)

       Username                   Email    Id First name Last name Active
0      blu3FisH      rachel@example.com  9012     Rachel    Booker    Yes
1     GreenFr0g   laura@yourcompany.com  2070      Laura      Grey    Yes
2      blackd0g   craig@yourcompany.com  4081      Craig   Johnson     No
3     jenkins46        mary@example.com  9346       Mary   Jenkins    Yes
4       smith79       jamie@example.com  5079      Jamie     Smith    Yes
5        john00               js@co.com   303       John     Smith     No
6   BlackTurkey    jhalprin@example.com   304        Jim   Halprin    Yes
7      BlueHawk      tjones@example.com   305     Teresa     Jones    Yes
8     GreenTree    tomjones@example.com   306      Tommy     Jones    Yes
9    OrangeFish  greggjones@example.com   307      Gregg     Jones    Yes
10      RedBoat   dthompson@example.com   308     Daniel  Thompson    Yes

In [82]:
brics = pd.read_csv("data/brics.csv", index_col=0)

### Head and tail
To view a small sample of a Series or DataFrame object, use the head() and tail() methods. The default number of elements to display is five, but you may pass a custom number.

In [83]:
df.head()

    Username                  Email    Id First name Last name Active
0   blu3FisH     rachel@example.com  9012     Rachel    Booker    Yes
1  GreenFr0g  laura@yourcompany.com  2070      Laura      Grey    Yes
2   blackd0g  craig@yourcompany.com  4081      Craig   Johnson     No
3  jenkins46       mary@example.com  9346       Mary   Jenkins    Yes
4    smith79      jamie@example.com  5079      Jamie     Smith    Yes

In [84]:
df.tail(3)

      Username                   Email   Id First name Last name Active
8    GreenTree    tomjones@example.com  306      Tommy     Jones    Yes
9   OrangeFish  greggjones@example.com  307      Gregg     Jones    Yes
10     RedBoat   dthompson@example.com  308     Daniel  Thompson    Yes

### Attributes and underlying data

In [85]:
brics.describe()

            area   population
count   5.000000     5.000000
mean    7.944000   601.176000
std     6.200557   645.261454
min     1.221000    52.980000
25%     3.286000   143.500000
50%     8.516000   200.400000
75%     9.597000  1252.000000
max    17.100000  1357.000000

In [86]:
brics.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, BR to SA
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     5 non-null      object
 1   capital     5 non-null      object
 2   area        5 non-null      float64
 3   population  5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 200.0+ bytes

`shape`: gives the axis dimensions of the object, consistent with ndarray
(entries, columns)

In [87]:
brics.shape

(5, 4)

In [88]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

## Summary statistics
Basic statistics (mean, median, min, max, counts…) are easily calculable.

describe() shows a quick statistic summary of your data

In [134]:
city_pop = pd.read_csv("data/population_tr.csv", sep=';')
city_pop.describe()

,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
count,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01,...,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01,8.200000e+01
mean,1.578768e+06,1.600077e+06,1.619557e+06,1.638713e+06,1.658786e+06,1.679525e+06,1.700731e+06,1.721616e+06,1.744320e+06,1.769788e+06,...,1.844570e+06,1.869948e+06,1.895022e+06,1.920513e+06,1.946704e+06,1.970988e+06,2.000095e+06,2.028171e+06,2.039375e+06,2.065373e+06
std,7.182483e+06,7.280900e+06,7.371050e+06,7.459777e+06,7.552731e+06,7.648774e+06,7.746996e+06,7.843821e+06,7.946958e+06,8.064122e+06,...,8.413460e+06,8.531728e+06,8.647138e+06,8.765726e+06,8.884413e+06,8.996369e+06,9.125385e+06,9.258787e+06,9.307607e+06,9.429832e+06
min,7.522100e+04,7.551700e+04,7.570900e+04,7.586800e+04,7.605000e+04,7.624600e+04,7.644400e+04,7.660900e+04,7.567500e+04,7.471000e+04,...,7.579700e+04,7.562000e+04,8.060700e+04,7.855000e+04,8.219300e+04,8.041700e+04,8.227400e+04,8.466000e+04,8.191000e+04,8.364500e+04
25%,2.719395e+05,2.745638e+05,2.768472e+05,2.780260e+05,2.792188e+05,2.797688e+05,2.800030e+05,2.801020e+05,2.799185e+05,2.816318e+05,...,2.821075e+05,2.839870e+05,2.851542e+05,2.878490e+05,2.900632e+05,2.888318e+05,2.912432e+05,2.898100e+05,2.899328e+05,2.952515e+05
50%,4.834845e+05,4.875495e+05,4.902015e+05,4.922440e+05,4.903035e+05,4.883865e+05,4.864035e+05,4.841275e+05,4.849110e+05,4.926815e+05,...,5.118330e+05,5.172040e+05,5.195050e+05,5.192605e+05,5.250190e+05,5.294195e+05,5.380700e+05,5.374790e+05,5.396550e+05,5.498005e+05
75%,8.642182e+05,8.751728e+05,8.851078e+05,8.948490e+05,9.050718e+05,9.156418e+05,9.264468e+05,9.370595e+05,9.535840e+05,9.659568e+05,...,9.925450e+05,1.006584e+06,1.026159e+06,1.038490e+06,1.052617e+06,1.065313e+06,1.080791e+06,1.097082e+06,1.109579e+06,1.128873e+06
max,6.472950e+07,6.560316e+07,6.640185e+07,6.718725e+07,6.801022e+07,6.886054e+07,6.972997e+07,7.058626e+07,7.151710e+07,7.256131e+07,...,7.562738e+07,7.666786e+07,7.769590e+07,7.874105e+07,7.981487e+07,8.081052e+07,8.200388e+07,8.315500e+07,8.361436e+07,8.468027e+07

## Series  
A Series is a one-dimensional sequence of labeled data.
One-dimensional ndarray with axis labels  
(Like a column in the table)

Note that the visual display of a Series is just **plain text**, as opposed to the nicely styled table for DataFrames. You will also see the data type or dtype of the Series.

### Selecting data with just the indexing operator

- Selecting a single column as a Series 
<br>To select a single column of data, simply put the name of the column in-between the brackets.
```
brics['capital']
brics.capital:
```

- Selecting multiple columns as a DataFrame: `brics[['country', 'capital']]`
<br>Pass a list as an argument to df index: [ [] ]

In [118]:
brics['capital']    # Series

code
BR     Brasilia
RU       Moscow
IN    New Delhi
CH      Beijing
SA     Pretoria
Name: capital, dtype: object

In [121]:
type(brics['capital'])  # pandas.core.series.Series

pandas.core.series.Series

In [123]:
brics[['country', 'capital']]

           country    capital
code
BR          Brazil   Brasilia
RU          Russia     Moscow
IN           India  New Delhi
CH           China    Beijing
SA    South Africa   Pretoria

In [125]:
type(brics[['country', 'capital']])  # pandas.core.frame.DataFrame

pandas.core.frame.DataFrame

### Select Row(s)
The `.loc` indexer can select subsets of rows or columns. 
Most importantly, it only selects data by the **LABEL** of the rows and columns.

- Select a single row as a Series with .loc       : `.loc['RU']`
- Select multiple rows as a DataFrame with .loc   : `.loc[['IN', 'RU']]`
- Use slice notation to select a range of rows: `.loc['IN':'SA']`
- elect a single row and a single column. This returns a scalar value: `brics.loc['RU', 'capitol']`
- Select 2 rows and 2 columns: `brics.loc[['IN', 'RU'],['country', 'capital']]`
- Select all of the rows and 2 columns: `brics.loc[:, ['country', 'capital']]`
- Select a column (all of the rows): `brics.loc[:, ['capital']]`

In [96]:
brics.loc['RU']

country       Russia
capital       Moscow
area            17.1
population     143.5
Name: RU, dtype: object

In [99]:
brics.loc[['RU', 'IN']]

     country    capital    area  population
code
RU    Russia     Moscow  17.100       143.5
IN     India  New Delhi   3.286      1252.0

In [117]:
brics.loc['IN':'SA']    # Note that .loc includes the last value with slice notation!

           country    capital   area  population
code
IN           India  New Delhi  3.286     1252.00
CH           China    Beijing  9.597     1357.00
SA    South Africa   Pretoria  1.221       52.98

In [101]:
brics.loc['RU', 'capital']

'Moscow'

In [100]:
brics.loc[['IN', 'RU'],['country', 'capital']]

     country    capital
code
IN     India  New Delhi
RU    Russia     Moscow

In [103]:
brics.loc[:, ['country', 'capital']]

           country    capital
code
BR          Brazil   Brasilia
RU          Russia     Moscow
IN           India  New Delhi
CH           China    Beijing
SA    South Africa   Pretoria

In [107]:
brics.loc[:, 'capital'] # Series

code
BR     Brasilia
RU       Moscow
IN    New Delhi
CH      Beijing
SA     Pretoria
Name: capital, dtype: object

In [108]:
brics.loc[:, ['capital']]   # DataFrame

        capital
code
BR     Brasilia
RU       Moscow
IN    New Delhi
CH      Beijing
SA     Pretoria

### Slicing
Note that when slicing, no braces inside .loc[:,:]

In [ ]:
df.loc[:, 'Email']

0         rachel@example.com
1      laura@yourcompany.com
2      craig@yourcompany.com
3           mary@example.com
4          jamie@example.com
5                  js@co.com
6       jhalprin@example.com
7         tjones@example.com
8       tomjones@example.com
9     greggjones@example.com
10     dthompson@example.com
Name: Email, dtype: object

In [ ]:
df.loc[:, ['Id','Last name']]

      Id Last name
0   9012    Booker
1   2070      Grey
2   4081   Johnson
3   9346   Jenkins
4   5079     Smith
5    303     Smith
6    304   Halprin
7    305     Jones
8    306     Jones
9    307     Jones
10   308  Thompson

In [ ]:
df.loc[:, 'First name':'Active']

   First name Last name Active
0      Rachel    Booker    Yes
1       Laura      Grey    Yes
2       Craig   Johnson     No
3        Mary   Jenkins    Yes
4       Jamie     Smith    Yes
5        John     Smith     No
6         Jim   Halprin    Yes
7      Teresa     Jones    Yes
8       Tommy     Jones    Yes
9       Gregg     Jones    Yes
10     Daniel  Thompson    Yes

### Selecting subsets with .iloc
The .iloc indexer is very similar to .loc but only uses integer locations to make its selections.

pandas provides a suite of methods in order to get purely integer based indexing. (0-based)
```
df.iloc[0]
```
- Selecting a single row with .iloc: `.iloc[0]` 
- Selecting multiple rows with .iloc: `.iloc[[0, 2, 4]]`
- Use slice notation to select a range of rows: `.iloc[3:5]`
- Selecting 2 rows and 2 columns: `.iloc[[0,4], [0, 2]]`

In [110]:
brics.iloc[0]   # Series

country         Brazil
capital       Brasilia
area             8.516
population       200.4
Name: BR, dtype: object

In [111]:
brics.iloc[[0, 2, 4]]   # remember, don't do df.iloc[5, 2, 4]

           country    capital   area  population
code
BR          Brazil   Brasilia  8.516      200.40
IN           India  New Delhi  3.286     1252.00
SA    South Africa   Pretoria  1.221       52.98

In [113]:
brics.iloc[2:4]

     country    capital   area  population
code
IN     India  New Delhi  3.286      1252.0
CH     China    Beijing  9.597      1357.0

In [114]:
brics.iloc[[0, 4], [0, 2]]

           country   area
code
BR          Brazil  8.516
SA    South Africa  1.221

Filtering

In [92]:
df['Active'] == "Yes"
# df.Active == "Yes"

0      True
1      True
2     False
3      True
4      True
5     False
6      True
7      True
8      True
9      True
10     True
Name: Active, dtype: bool